Tekla Open API Reference for Tekla Structures 2025
Operation.IsNumberingAllowed Method
 Checks whether the numbering is allowed or not in the current configuration.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsNumberingAllowed()
Public Shared Function IsNumberingAllowed As Boolean
Return Value
Type: Boolean
True if the numbering is allowed.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace